scripts/load-test-redirect.yml
config:
  target: "{{ $processEnvironment.LOAD_TEST_TARGET }}"
  phases:
    - name: redirect warmup
      duration: 60
      arrivalRate: 100
      rampTo: 1000
    - name: redirect sustained high load
      duration: 180
      arrivalRate: 1000
      maxVusers: 5000
    - name: rate-limit probe
      duration: 30
      arrivalRate: 1500
      maxVusers: 5000
  ensure:
    thresholds:
      - http.response_time.p50: 5
      - http.response_time.p99: 500
      - http.codes.308: 95
  plugins:
    expect: {}
scenarios:
  - name: cached redirect
    flow:
      - get:
          url: "/{{ $processEnvironment.LOAD_TEST_SLUG }}"
          followRedirect: false
          expect:
            - statusCode: 308